doc/org/gameplay.org
#+TITLE Core Concepts for Gameplay Code

Core Concepts for Gameplay Code

* Intro
This document gives an overview of the core concepts for writing gameplay code in the Hubs client.

* Entities, components, systems.
ECS became a popular topic in recent years.
- Unity's ~DOTS~ emphasizes data-oriented design for speed and control, separates behavior from data, and helps developers build multi-threaded game loops.
- Supermedium's ~A-Frame~ emphasizes ease of use and a low barrier to entry, exposes three.js through familiar HTML, and enables rapid prototyping with many built-in components and hundreds more from the community.

Originally built with ~A-Frame~, Hubs switched to ~bitECS~ and using ~three.js~ directly. Motivation, goals, and non-goals about the transition can be found in this PR from June, 2022. https://github.com/mozilla/hubs/pull/5536

** ~bitECS~
The ~bitECS~ API is minimal, and its own documentation should be consulted for details. The main ideas from the Hubs gameplay code perspective are:

- Component data are structs of arrays. https://en.wikipedia.org/wiki/AoS_and_SoA
- Entities are indices into these arrays.
- Queries filter entities by their associated components.

~bitECS~ has no built-in concept of systems. We frequently refer the functions invoked during the game loop as "systems", but there is no formal construct.

** Disclaimer
Much has been written about the philosophy of various ECS frameworks and design choices. Our choices should not be interpreted fanatically.

We need to store game state somehow, and conventions are useful. We use three.js, which means a lot of game state is stored in various ~Object3D~ subtypes. We store the rest in ~bitECS~ entities and components, or ~map~ s from entity to struct in cases where ~bitECS~ components won't do.

In other words, our game state is not "purely" in ECS, nor do we care to make it so. The PR linked above states the (relatively humble) goals and non-goals of our entity framework.

* Writing systems

** Systems are functions

~bitECS~ has no built-in concept of systems. We frequently refer the functions invoked during the game loop as "systems", but there is no formal construct.

** The game loop

We provide the browser's ~requestAnimationFrame~ with our game loop function (~mainTick~), to be invoked each frame.

** Queries are useful

~bitECS~ queries allow us to find entities based on the components that are attached to them. ~enterQuery~ and ~exitQuery~ wrap regular queries so that we handle when an entity first matches or stops matching a given query. The ~bitECS~ documentation should be consulted for more details.

** Replacing ~async~ functions with ~coroutines~

TODO: Describe ~JobRunner~ and ~coroutine~ s.

* Writing components

** Defining components

~bitECS~ components are defined with ~defineComponent~.

** Data types

~bitECS~ components only store numeric types: ~i8~, ~ui8~, ~ui8c~, ~i16~, ~ui16~, ~i32~, ~ui32~, ~f32~, ~f64~, and ~eid~.

The sections below describe what we do when we need to store non-numeric data.

** Avoid holding references

The ~eid~ type indicates that the property values will be entity IDs. Be careful when storing references to entities. If the referenced entity is removed from the world with ~removeEntity~, then you should consider the entity reference in the component to be invalid! You can use ~entityExists~ to check whether the referenced entity still exists, but in general it is best to avoid storing entity references if you can.

The most common scenario for using the ~eid~ type is when building multi-entity objects, such as in-world menus. The ~VideoMenu~ component stores references to each entity so that it can manage them all easily.

#+begin_src typescript
export const VideoMenu = defineComponent({
  videoRef: Types.eid,
  timeLabelRef: Types.eid,
  trackRef: Types.eid,
  headRef: Types.eid,
  playIndicatorRef: Types.eid,
  pauseIndicatorRef: Types.eid
});
#+end_src

** Entity ID's are recycled

After an entity is removed (by ~removeEntity~), its ~EntityID~ can later be reused in subsequent calls to ~addEntity~. This does not happen right away, but is something you should be aware of, and is all the more reason to avoid holding onto entity references.

** String data
We sometimes want to be able to store string data in components. Since ~bitECS~ does not allow strings in components, we store numeric string ID's instead.

For example, consider a ~SceneLoader~ component with a ~src~ property, which we wish was a string.

#+begin_src typescript
export const SceneLoader = defineComponent({ src: Types.ui32 });
SceneLoader.src[$isStringType] = true;
#+end_src

The symbol ~$isStringType~, defined in ~bit-components.js~, indicates that this property is a string handle. Code that handles component state anonymously (e.g. ~createDefaultInflator~) use this to correctly handle the property values.

Strings are converted to numeric ~StringID~ s by the ~getSid~ function. ~StringID~ s can be converted back to strings by the ~getString~ function.

#+begin_src typescript
const src = APP.getString(SceneLoader.src[loaderEid]);
console.log(`Loading scene from this url: ${src}`);
#+end_src

