doc/org/build/gameplay.md
- [Intro](#org71ab195)
- [Entities, components, systems.](#org739a535)
  - [`bitECS`](#org0bfe8ab)
  - [Disclaimer](#orgff3efea)
- [Writing systems](#org751fbe1)
  - [Systems are functions](#org775dcd0)
  - [The game loop](#orga589afa)
  - [Queries are useful](#org1d5d556)
  - [Replacing `async` functions with `coroutines`](#org2233e62)
- [Writing components](#org7331485)
  - [Defining components](#org18a6d0b)
  - [Data types](#org3db6503)
  - [Avoid holding references](#org589f3d9)
  - [Entity ID&rsquo;s are recycled](#org31d40f6)
  - [String data](#orgdf10967)
  - [Flags](#org70bd5dd)
  - [Tag components](#org58d595d)
  - [The escape hatch](#orga5547d0)
  - [Associating entities with `Object3D` s](#orgf29a631)
  - [Avoid duplicating state](#orgfe9fb09)
- [Adding entities](#orgbad6d63)
  - [Entity basics](#org9d285be)
  - [Creating `EntityDef` s](#orgdd790f5)
  - [Creating model files](#org156c909)
  - [Entity creation is synchronous](#org2319bae)
  - [Inflation](#org628683b)
    - [What does `renderAsEntity` do?](#org20a38aa)
    - [`Inflator` s](#org357d40d)
    - [Default inflators](#orga810c47)
    - [Associating `Object3D` s (`eid2obj`)](#org4f9fcd3)
    - [Loading model files](#org7a41123)
    - [Common inflators, `jsxInflators`, and `gltfInflators`](#org8ca2b33)
    - [Entity `Ref` s and `__mhc_link_type` : `"node"`](#orgfcfa191)
    - [Associating `Material` s (`eid2mat`)](#org7fe068b)
- [Custom clients and addons](#org1a8110a)
  - [Addons are not ready yet (February 2023)](#org2b06d43)
  - [Creating an add-on](#org35960ac)
  - [`preload`](#orge79e4e1)
  - [Inserting prefabs](#org1d14013)
  - [Inserting inflators](#org86ae847)
  - [Inserting system calls](#org354b138)
  - [Handling interactions](#org306c661)
  - [Handling networking](#org19b999f)

\#+TITLE Core Concepts for Gameplay Code

Core Concepts for Gameplay Code


<a id="org71ab195"></a>

# Intro

This document gives an overview of the core concepts for writing gameplay code in the Hubs client.


<a id="org739a535"></a>

# Entities, components, systems.

ECS became a popular topic in recent years.

-   Unity&rsquo;s `DOTS` emphasizes data-oriented design for speed and control, separates behavior from data, and helps developers build multi-threaded game loops.
-   Supermedium&rsquo;s `A-Frame` emphasizes ease of use and a low barrier to entry, exposes three.js through familiar HTML, and enables rapid prototyping with many built-in components and hundreds more from the community.

Originally built with `A-Frame`, Hubs switched to `bitECS` and using `three.js` directly. Motivation, goals, and non-goals about the transition can be found in this PR from June, 2022. <https://github.com/mozilla/hubs/pull/5536>


<a id="org0bfe8ab"></a>

## `bitECS`

The `bitECS` API is minimal, and its own documentation should be consulted for details. The main ideas from the Hubs gameplay code perspective are:

-   Component data are structs of arrays. <https://en.wikipedia.org/wiki/AoS_and_SoA>
-   Entities are indices into these arrays.
-   Queries filter entities by their associated components.

`bitECS` has no built-in concept of systems. We frequently refer the functions invoked during the game loop as &ldquo;systems&rdquo;, but there is no formal construct.


<a id="orgff3efea"></a>

## Disclaimer

Much has been written about the philosophy of various ECS frameworks and design choices. Our choices should not be interpreted fanatically.

We need to store game state somehow, and conventions are useful. We use three.js, which means a lot of game state is stored in various `Object3D` subtypes. We store the rest in `bitECS` entities and components, or `map` s from entity to struct in cases where `bitECS` components won&rsquo;t do.

In other words, our game state is not &ldquo;purely&rdquo; in ECS, nor do we care to make it so. The PR linked above states the (relatively humble) goals and non-goals of our entity framework.


<a id="org751fbe1"></a>

# Writing systems


<a id="org775dcd0"></a>

## Systems are functions

`bitECS` has no built-in concept of systems. We frequently refer the functions invoked during the game loop as &ldquo;systems&rdquo;, but there is no formal construct.


<a id="orga589afa"></a>

## The game loop

We provide the browser&rsquo;s `requestAnimationFrame` with our game loop function (`mainTick`), to be invoked each frame.


<a id="org1d5d556"></a>

## Queries are useful

`bitECS` queries allow us to find entities based on the components that are attached to them. `enterQuery` and `exitQuery` wrap regular queries so that we handle when an entity first matches or stops matching a given query. The `bitECS` documentation should be consulted for more details.


<a id="org2233e62"></a>

## Replacing `async` functions with `coroutines`

TODO: Describe `JobRunner` and `coroutine` s.


<a id="org7331485"></a>

# Writing components


<a id="org18a6d0b"></a>

## Defining components

`bitECS` components are defined with `defineComponent`.


<a id="org3db6503"></a>

## Data types

`bitECS` components only store numeric types: `i8`, `ui8`, `ui8c`, `i16`, `ui16`, `i32`, `ui32`, `f32`, `f64`, and `eid`.

The sections below describe what we do when we need to store non-numeric data.


<a id="org589f3d9"></a>

## Avoid holding references

The `eid` type indicates that the property values will be entity IDs. Be careful when storing references to entities. If the referenced entity is removed from the world with `removeEntity`, then you should consider the entity reference in the component to be invalid! You can use `entityExists` to check whether the referenced entity still exists, but in general it is best to avoid storing entity references if you can.

The most common scenario for using the `eid` type is when building multi-entity objects, such as in-world menus. The `VideoMenu` component stores references to each entity so that it can manage them all easily.

```typescript
export const VideoMenu = defineComponent({
  videoRef: Types.eid,
  timeLabelRef: Types.eid,
  trackRef: Types.eid,
  headRef: Types.eid,
  playIndicatorRef: Types.eid,
  pauseIndicatorRef: Types.eid
});
```


<a id="org31d40f6"></a>

## Entity ID&rsquo;s are recycled

After an entity is removed (by `removeEntity`), its `EntityID` can later be reused in subsequent calls to `addEntity`. This does not happen right away, but is something you should be aware of, and is all the more reason to avoid holding onto entity references.


<a id="orgdf10967"></a>

## String data

We sometimes want to be able to store string data in components. Since `bitECS` does not allow strings in components, we store numeric string ID&rsquo;s instead.

For example, consider a `SceneLoader` component with a `src` property, which we wish was a string.

```typescript
export const SceneLoader = defineComponent({ src: Types.ui32 });
SceneLoader.src[$isStringType] = true;
```

The symbol `$isStringType`, defined in `bit-components.js`, indicates that this property is a string handle. Code that handles component state anonymously (e.g. `createDefaultInflator`) use this to correctly handle the property values.

Strings are converted to numeric `StringID` s by the `getSid` function. `StringID` s can be converted back to strings by the `getString` function.

```typescript
const src = APP.getString(SceneLoader.src[loaderEid]);
console.log(`Loading scene from this url: ${src}`);
```
