doc/org/gameplay.org
** Flags

~bitECS~ components do not support ~boolean~ properties. In lieu of boolean properties, we often define a single ~flags~ property as an unsigned integer type to use as a bitmask:

#+begin_src typescript
export const Waypoint = defineComponent({
  flags: Types.ui8
});

// Use bit shifting to create values we can use instead of booleans
export enum WaypointFlags {
  canBeSpawnPoint = 1 << 0,
  canBeOccupied = 1 << 1,
  canBeClicked = 1 << 2,
  willDisableMotion = 1 << 3,
  willDisableTeleporting = 1 << 4,
  willMaintainInitialOrientation = 1 << 5,
  snapToNavMesh = 1 << 6
}

// These values are booleans because they originate from an external source, like json in a gltf file.
export interface WaypointParams {
  canBeSpawnPoint: boolean;
  canBeOccupied: boolean;
  canBeClicked: boolean;
  willDisableMotion: boolean;
  willDisableTeleporting: boolean;
  willMaintainInitialOrientation: boolean;
  snapToNavMesh: boolean;
}

// When we inflate a waypoint component, we pack the booleans into the flags property
export function inflateWaypoint(world: HubsWorld, eid: number, props: WaypointParams) {
  addComponent(world, Waypoint, eid);
  let flags = 0;
  if (props.canBeSpawnPoint) flags |= WaypointFlags.canBeSpawnPoint;
  if (props.canBeOccupied) flags |= WaypointFlags.canBeOccupied;
  if (props.canBeClicked) flags |= WaypointFlags.canBeClicked;
  if (props.willDisableMotion) flags |= WaypointFlags.willDisableMotion;
  if (props.willDisableTeleporting) flags |= WaypointFlags.willDisableTeleporting;
  if (props.willMaintainInitialOrientation) flags |= WaypointFlags.willMaintainInitialOrientation;
  if (props.snapToNavMesh) flags |= WaypointFlags.snapToNavMesh;
  Waypoint.flags[eid] = flags;

  // More lines omitted
}

// Later, we can read the waypoint flags using bitwise &:
const canBeSpawnPoint = Waypoint.flags[eid] & WaypointFlags.canBeSpawnPoint;
#+end_src

** Tag components

~bitECS~ components with no properties are called tag components. It is useful to be able to tag an entity so that it appears in queries.

** The escape hatch

Sometimes, we need to store data that is just numbers and strings. Since we can't store the data in ~bitECS~ components, we store it in regular ~Map~ s instead.

For example, the ~MediaPDF~ component stores a numeric ~pageNumber~, and separately has a (uninspiringly named) ~map~ property:

#+begin_src typescript
export const MediaPDF = defineComponent({
  pageNumber: Types.ui8
});
MediaPDF.map = new Map();
#+end_src

In typescript, we specify the data types we will store in the map:
#+begin_src typescript
export interface PDFResources {
  pdf: PDFDocumentProxy;
  material: MeshBasicMaterial;
  canvasContext: CanvasRenderingContext2D;
}
export const PDFResourcesMap = (MediaPDF as any).map as Map<EntityID, PDFResources>;
#+end_src

It is our responsibility to clean up anything we put into the map:
#+begin_src typescript
pdfExitQuery(world).forEach(function (eid) {
  const resources = PDFResourcesMap.get(eid)!;
  resources.pdf.cleanup();
  disposeMaterial(resources.material);
  PDFResourcesMap.delete(eid);
});
#+end_src


** Associating entities with ~Object3D~ s
We often associate an entity with an ~Object3D~. We do this by adding an ~Object3DTag~ component to the entity, storing the association in ~world.eid2obj~, and setting ~obj.eid~ to the ~EntityID~.

An entity can only be associated with a single ~Object3D~.

You may find it strange that we have a different pattern for ~world.eid2obj~, and that we do not simply use the same pattern as the one shown above for ~MediaPDF~. Well, I do too. We wrote ~world.eid2obj~ long before we wrote ~MediaPDF~, so this may be an accident. Perhaps we'll change ~world.eid2obj~ to ~Object3DTag.map~, since the ~eid2obj~ map is meant to be kept in sync with the ~Object3DTag~ component.

** Avoid duplicating state

~Object3D~ and its subtypes have many properties that change at runtime. Rather than storing a duplicate copy of these properties in ~bitECS~ components, we use tag components on the entity so that they show up in the necessary queries, and then operate on the associated ~Object3D~ directly.

For example, ~TroikaText~ extends ~Mesh~, which extends ~Object3D~. ~TroikaText~ s have a ~text~ string property and a function ~sync~ that will flush the ~text~ to the underlying shader program.

In Hubs, we define the ~Text~ component as a tag (i.e. with no properties):
#+begin_src typescript
export const Text = defineComponent();
#+end_src

We do not duplicate the ~text~ string in a ~bitECS~ component. We simply operate on the underlying ~Object3D~ (a ~TroikaText~):

#+begin_src typescript
const timeLabel = world.eid2obj.get(VideoMenu.timeLabelRef[eid])! as TroikaText;
timeLabel.text = `${timeFmt(video.currentTime)} / ${timeFmt(video.duration)}`;
timeLabel.sync();
#+end_src

* Adding entities
** Entity basics

Entities are added to the world with ~addEntity~ and removed from the world with ~removeEntity~. In ~bitECS~, component state is stored in large, pre-allocated ~TypedArrays~. In other words, entities are not objects with components inside them. Entities are simply numbers (~EntityID~ s), and the ~World~ keeps track of things like whether an entity has a given component (~hasComponent(world, MyComponent, eid)~).

You will rarely need to call ~addEntity~ yourself. Instead, you will write entity definitions (~EntityDef~ s) using ~jsx~ or create model files (~gltf~) with that add entities and components when the models are loaded.

Note: We support both ~glTF~ formats, where binary data buffers contain base64-encoded strings (as in ~.gltf~) or raw byte arrays (as in ~.glb~). We refer to ~gltf~ and ~glb~ files interchangably.

** Creating ~EntityDef~ s

~EntityDef~ s are ~jsx~ expressions that can be passed to ~renderAsEntity~ to add entities and components to the world. ~EntityDef~ s are commonly returned from ~template~ functions, which take some ~InitialData~ and return an ~EntityDef~ with the that ~InitialData~ applied.

For example, the commonly used ~MediaPrefab~ function is a ~template~ that takes ~MediaLoaderParams~ as its ~InitialData~, and returns an ~EntityDef~ for an interactable object.

#+begin_src typescript
export function MediaPrefab(params: MediaLoaderParams): EntityDef {
  return (
    <entity
      name="Interactable Media"
      networked
      networkedTransform
      mediaLoader={params}
      deletable
      grabbable={{ cursor: true, hand: true }}
      destroyAtExtremeDistance
      floatyObject={{
        flags: FLOATY_OBJECT_FLAGS.MODIFY_GRAVITY_ON_RELEASE,
        releaseGravity: 0
      }}
      networkedFloatyObject={{
        flags: FLOATY_OBJECT_FLAGS.MODIFY_GRAVITY_ON_RELEASE
      }}
      rigidbody={{ collisionGroup: COLLISION_LAYERS.INTERACTABLES, collisionMask: COLLISION_LAYERS.HANDS }}
      physicsShape={{ halfExtents: [0.22, 0.14, 0.1] }} /* TODO Physics shapes*/
      scale={[1, 1, 1]}
    />
  );
}
#+end_src

Although ~EntityDef~ s are written with ~jsx~ syntax, this is not ~React~. The ~jsx~ syntax allows us to describe our desired scene graph, entities, and components. The definition is static, and there should be no expectation of "re-rendering" (as in ~React~ or ~three-fiber~). Semantically, an ~EntityDef~ is equivalent to a model file with component data. ~EntityDef~ s are meant to be easy to edit by hand and to version control.

For ~network instantiated~ entities, ~template~ functions are grouped together with ~permission~ information to form a named ~Prefab~. More information about ~network instantiated~ entities can be found in the networking documentation.

** Creating model files

Equivalently, hubs components can be added to nodes in a GLTF file with the ~MOZ_hubs_components~ extension.

The ~hubs-blender-exporter~ is a Blender add-on that helps artists do this.

Spoke also includes component data in the gltf files that it exports and uploads.

