doc/org/build/gameplay.md


<a id="org2319bae"></a>

## Entity creation is synchronous

It is important to realize that `renderAsEntity` is a synchronous function. That is, it will immediately return a valid `EntityID` with a corresponding `Object3D` added to the scene graph.

The presence of some components (like `MediaLoader`) cause systems to begin asynchronous work. In the case of `MediaLoader`, this work can include downloading model or image files, loading them with the GLTF loader, and ultimately creating additional entities and components. But the entity at the root of this `Object3D` hierarchy will be created synchronously/immediately when `renderAsEntity` runs.


<a id="org628683b"></a>

## Inflation


<a id="org20a38aa"></a>

### What does `renderAsEntity` do?

In the example above, we show a `template` function (`MediaPrefab`) that takes some `InitialData` (the `MediaLoaderParams`) and returns an `EntityDef`. We then said that the `EntityDef` can be passed to `renderAsEntity` which will (synchronously) add entities and components to the world. We also said this was equivalent to loading a model file (GLTF).

Question: How does `renderAsEntity` (and whatever loads models) accomplish this? Answer: By running `inflators`.


<a id="org357d40d"></a>

### `Inflator` s

An `inflator` is a function that transforms a <span class="underline">description</span> of some components/entities into real components and real entities.

When `renderAsEntity` is given the `EntityDef` generated by the `MediaPrefab` above, it will run an `inflator` for each of the properties found in the `jsx` expression.

For example, the `jsx` expression contains the following line:

```typescript
  grabbable={{ cursor: true, hand: true }}
```

When `renderAsEntity` parses this line, it checks the `jsxInflators` map (for the key `"grabbable"` ) to find the associated inflator (`inflateGrabbable`), and calls it.

The `inflateGrabbable` function transforms the description into the necessary runtime components:

```typescript
export type GrabbableParams = { cursor: boolean; hand: boolean };
const defaults: GrabbableParams = { cursor: true, hand: true };
export function inflateGrabbable(world: HubsWorld, eid: number, props: GrabbableParams) {
  props = Object.assign({}, defaults, props);
  if (props.hand) {
    addComponent(world, HandCollisionTarget, eid);
    addComponent(world, OffersHandConstraint, eid);
  }
  if (props.cursor) {
    addComponent(world, CursorRaycastable, eid);
    addComponent(world, RemoteHoverTarget, eid);
    addComponent(world, OffersRemoteConstraint, eid);
  }
  addComponent(world, Holdable, eid);
}
```

Notice that `GrabbableParams` do not map one-to-one with runtime components. That is, there is no `Grabbable` component. This is common in situations where we want to expose user-friendly options (for use in Blender, Spoke, or when writing `EntityDef` s), while representing the information differently at runtime.


<a id="orga810c47"></a>

### Default inflators

For many components, the `EntityDef` or `GLTF` representation DOES match the runtime component, and writing individual inflators for each would be unnecessary boilerplate.

For example, the `SceneLoader` component has a single property, a string `src`:

```typescript
export const SceneLoader = defineComponent({ src: Types.ui32 });
SceneLoader.src[$isStringType] = true;
```

It can be specified in the following `EntityDef` :

```typescript
export function ScenePrefab(src: string): EntityDef {
  return <entity name="Scene" sceneRoot sceneLoader={{ src }} />;
}
```

Writing the inflator for the `SceneLoader` component is simple, except for the fact that we have to remember to convert the `string` to a `StringID`, so that the `bitECS` component can hold onto it:

```typescript
export function inflateSceneLoader(world: HubsWorld, eid: number, props: { src: string }) {
  addComponent(world, SceneLoader, eid);
  SceneLoader.src[eid] = APP.getSid(props.src); // Convert string to string id
}
```

In our `jsxInflators` map, we would associate `"sceneLoader"` with `inflateSceneLoader` :

```typescript
  sceneLoader: inflateSceneLoader,
```

This situation is so common that we have a helper function, `createDefaultInflator`, that we can use instead of writing `inflateSceneLoader` manually. We simply pass the component we want to inflate to `createDefaultInflator` and we&rsquo;re done:

```typescript
  sceneLoader: createDefaultInflator(SceneLoader),
```

The default inflator handles the conversion from `string` s to `StringID`, and will log an error if a property name is passed to the `inflator` that does not have a corresponding property in the underlying component.


<a id="org4f9fcd3"></a>

### Associating `Object3D` s (`eid2obj`)

Most of the time, we add a component definition to an `EntityDef` or model file just to cause some component data to be associated with an entity. Sometimes, we want to control the `Object3D` that will be inserted into the scene graph for this entity.

We do this by calling `addObject3DComponent` from within an `inflator`.

For example, when a `simpleWater` component is found within a node of a GLTF file, the `inflateSimpleWater` inflator will create a `SimpleWaterMesh` with the given params and associate it with the given `EntityID` :

```typescript
export function inflateSimpleWater(world: HubsWorld, eid: EntityID, params: SimpleWaterParams) {
  params = Object.assign({}, DEFAULTS, params);
  const lowQuality = APP.store.state.preferences.materialQualitySetting !== "high";
  const simpleWater = new SimpleWaterMesh({ lowQuality });
  simpleWater.opacity = params.opacity;
  simpleWater.color.set(params.color);
  simpleWater.tideHeight = params.tideHeight;
  simpleWater.tideScale.fromArray(params.tideScale);
  simpleWater.tideSpeed.fromArray(params.tideSpeed);
  simpleWater.waveHeight = params.waveHeight;
  simpleWater.waveScale.fromArray(params.waveScale);
  simpleWater.waveSpeed.fromArray(params.waveSpeed);
  simpleWater.ripplesScale = params.ripplesScale;
  simpleWater.ripplesSpeed = params.ripplesSpeed;

  addObject3DComponent(world, eid, simpleWater);
  addComponent(world, SimpleWater, eid);
}
```

Only one inflator per entity can create and assign an `Object3D`. An `EntityDef` that describes an entity that is both a `SimpleWaterMesh` and a `DirectionalLight` will fail to load:

```typescript
renderAsEntity(
  <entity
      name="Buggy Entity"
      simpleWater
      directionalLight
  />
); // throws Error("Tried to add an object3D tag to an entity that already has one");

```

By default, if no `inflator` creates an `Object3D` for the entity, then `renderAsEntity` will create and assign it a `Group`.
