doc/org/gameplay.org
*** Loading model files

The sections above explain how ~renderAsEntity~ transforms a ~jsx~ ~EntityDef~ into an entity and components, and claims that the process for loading a ~gltf~ file is equivalent.

We are now ready to understand why, and will explain by example.

The ~EntityDef~ returned by the ~MediaPrefab~ template (above) includes a ~mediaLoader~, which will cause ~renderAsEntity~ to invoke the ~inflateMediaLoader~ inflator and assign a ~MediaLoader~ component to the entity.

Assume the ~MediaPrefab~ template is initialized with ~src~ set to the url of a ~gltf~ file. In other words, we are trying to use the ~MediaPrefab~ load a ~gltf~ file that we can grab and interact with.

We pass the ~EntityDef~ to ~renderAsEntity~, an entity is returned synchronously, and execution continues as normal.

When the ~mediaLoading~ system runs, it notices the new ~MediaLoader~ component and starts an asynchronous ~coroutine~ that determines the media type pointed to by the ~src~ property, downloads the ~gltf~ file and loads it as Three.js scene graph via a ~GLTFLoader~. Finally, the loaded scene graph is passed into an ~EntityDef~'s ~model~ parameter:

#+begin_src typescript
export function* loadModel(world: HubsWorld, src: string, contentType: string, useCache: boolean) {
  const { scene, animations } = yield loadGLTFModel(src, contentType, useCache, null);
  scene.animations = animations;
  scene.mixer = new THREE.AnimationMixer(scene);
  return renderAsEntity(world, <entity model={{ model: scene }} />);
}
#+end_src

In other words, the asynchronous work of loading the model is done ~before~ an entity is created for the loaded ~gltf~. Despite being called after some asynchronous work, the entity creation step that happens in ~renderAsEntity~ itself happens synchronously.

The ~model~ inflator (~inflateModel~) is to ~gltf~ files as ~renderAsEntity~ is to ~EntityDef~ s. You will notice that ~inflateModel~ invokes other component inflators and adds many entities to the world to match the ~Object3D~ hierarchy that was provided within the ~ModelParams~.

This is what we mean when we say that loading from ~gltf~ files is "equivalent" to loading from ~EntityDef~ s.

*** Common inflators, ~jsxInflators~, and ~gltfInflators~

We can now explain why there are three collections of ~inflators~:

- ~commonInflators~ are for components can be loaded (identically) whether they are defined in ~EntityDef~ s or ~gltf~ files.
- ~jsxInflators~ are for components that are specified in ~EntityDef~ s.
- ~gltfInflators~ are for components that are specified in ~gltf~ files.

Notice that in the sentences above, we overload the word ~components~. As we have shown, the data in ~EntityDef~ s or ~gltf~ files are not ~bitECS~ components, but need to be transformed (via ~inflator~ s) to their runtime formats (which is usually ~bitECS~ components).

While it might be helpful to define a ~new~ word (like "pre-components") to describe these data, we think this is overly complicated. From the perspective of the Blender add-on for example, its job is to add components (specifically, "~MOZ_hubs_components~") to nodes in the ~.blend~ scene and exported ~gltf~ files.

*** Entity ~Ref~ s and ~__mhc_link_type~ : ~"node"~
*** Associating ~Material~ s (~eid2mat~)

* Custom clients and addons
** Addons are not ready yet (February 2023)
We are exploring ways to enable add-ons within the Hubs client. This work is not complete, so expect this section to change in the near future.

We will need to start versioning each client deliberately so that developers can test and report which clients versions their add-on are compatible with. We will need to aim for backwards-compatibility and avoid breaking addons with changes, but we should things to be bumpy as we learn how best to structure the client.

Add-ons will require us to change how we update the hubs client on Managed or Hubs Cloud instances. If an add-on is installed on the instance that is not compatible with a new client version, we cannot auto-update the client without risking breaking the installed add-on.

Wordpress and Blender are good models to follow here. In general, if an add-on is not compatible with a new client version, upgrading the instance can be a user-initiated action. However, we may be required in some cases to push updates or partial updates that fix critical security vulnerabilities.

We will need to figure out how / where these addons will be hosted, how they will be installed, and to what extent Mozilla verifies that a given add-on is safe. We suspect that in the early days, add-ons will likely be installed via the admin interface, with a warning from us saying that you must trust the add-on developer is not doing anything nefarious, and that we have not validated or audited the code. This is similar to the warning that appears when installing add-ons to Firefox.

It will be easier for us to support custom clients than to support add-ons. Users should expect better support for writing, loading, and sharing custom clients soon, including on Managed instances.

In order for addons to do meaningful work, we need to expose a number of functions and data structures (and relax their types). The sections below describe the extension points we expect add-ons and custom clients will need to access.

** Creating an add-on
Hubs client add-ons will work similarly to how add-ons work in Blender. An addon will be a module that exports an ~info : AddonInfo~, a ~load~ function, and an ~unload~ function:

#+begin_src typescript
export const info : AddonInfo = {
  name: "My Special Addon",
  // etc
}

export function load( params : LoadCallbackParams ) {
  // Do whatever initialization you need to do when your add on is loaded
}

export function unload () {
  // Do whatever cleanup you need to do when your add on is unloaded

  // TODO Is it even possible for add-ons to be unloaded at runtime like this?
  //      If they are added/removed from the admin panel for the whole hub, then maybe unload is not needed.
}
#+end_src

Where the types will look something like this:
#+begin_src typescript
type AddonInfo = {
  name: string;
  author?: string;
  description?; string;
  compatibleWith?: ClientVersion[];
  version?: AddonVersion;
  location?: string;
  wikiUrl?: string;
  trackerUrl?: string;
  warning?: string;
  category?: AddonCategory;
  tags: AddonTag[];
}

interface LoadCallbackParams = {
  world: HubsWorld
  // Maybe other things?
}
#+end_src


** ~preload~

If your addon needs to complete some work before the main tick game loop runs, pass a ~Promise~ to the ~preload~ function that resolves once you are ready.

** Inserting prefabs

~Network instantiated~ entities must be registered in the ~prefabs~ map. See the ~networking~ documentation for more information.

** Inserting inflators

Custom components require you to register ~inflator~ s. Be sure to insert your ~inflator~ s into ~commonInflators~, ~jsxInflators~, or ~gltfInflators~ before calling ~renderAsEntity~ or invoking ~inflateModel~.

** Inserting system calls

The ~mainTick~ function calls all of the systems that need to run in a given animation frame. You will need to insert your system calls into this main game loop in the appropriate spot. We are not sure yet how we will expose this to addons. Custom client developers can insert it directly into the file that defines ~mainTick~.

