doc/org/build/gameplay.md


<a id="org306c661"></a>

## Handling interactions

Basic interactions like hovering, holding, and moving objects can be achieved with built-in components or inflators (like `inflateGrabbable`).

Custom interactions that define their own `actions`, `action sets`, and `device bindings` need to be able to append their `device bindings` and change the logic of `resolveActionSets`. We are not sure yet how we will expose these capabilities.

More information can be found in the interactions documentation.


<a id="org19b999f"></a>

## Handling networking

Add-ons and custom clients can define their own networked components. Developers will need to be especially careful when saving data to the database, as maintaining backwards compatibility with their chosen schema will be their responsibility. More information can be found in the networking documentation.
